{
    "main": {
        "name": "Derrek Gass",
        "occupation": "Full Stack Engineer",
        "description": "transforming science-fiction into science-fact.",
        "image": "portrait_1mb.png",
        "bio": [
            {
                "key": "headline",
                "text" : "Full Stack Engineer | Developing Innovative & Scalable Solutions"
            },
            {
                "key": "mainSkills",
                "text": "• 💻  Java, JavaScript, TypeScript, HTML, CSS, Node, React, Spring, PostgreSQL"
            },
            {
                "key": "other",
                "text": "• ⚡ Bash, Git, Jira, AWS, Docker, Kubernetes, REST, CI/CD, Agile/Scrum"
            },
            {
                "key": "curentStudies",
                "text": "• 🌱 Studying for: AWS Certification"
            },
            {
                "key": "learning",
                "text": "• 📖 Interests: Rust, Clojure, BETH stack"
            }
        ],
        "contactmessage": "Feel free to get in touch with me. I'd love to discuss an opportunity to work together.",
        "email": "derrekgass@gmail.com",
        "phone": "408-412-0755",
        "address": {
            "city": "Campbell",
            "state": "CA"
        },
        "company": "Lambda Phase Systems LLC",
        "website": "lambdaphase.com/",
        "resumedownload": "https://docs.google.com/document/d/1yOPA3XHZd0mtjZ01eR1ya2A9tEGxf8je/export?format=pdf",
        "social": [
            {
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/derrekgass/",
                "className": "fa fa-linkedin"
            },
            {
                "name": "github",
                "url": "https://github.com/derrek-gass",
                "className": "fa fa-github"
            },
            {
                "name": "E-Mail",
                "url": "mailto:derrekgass@gmail.com",
                "className": "fa fa-envelope"
            }
        ]
    },
    "resume": {
        "skillmessage": "",
        "education": [
            {
                "school": "CSU, Sacramento",
                "degree": "B.S. Computer Science & Engineering",
                "graduated": "2020",
                "awards": ["3.3 GPA", "Dean's List (3x)"],
                "description": [
                    "Software Engineering",
                    "Programming Languages",
                    "Data Structures & Algorithms",
                    "Computer Architecture",
                    "Theory of Computation",
                    "Formal Languages",
                    "Operating Systems",
                    "Distributed Systems", 
                    "Computer Modeling", 
                    "Computer Networks",
                    "Compiler Construction",
                    "AI & Machine Learning"]
            }
        ],
        "work": [
            {
                "company": "Northwestern Mutual",
                "title": "Software Engineer",
                "years": "March 2021 - February 2023",
                "description": [
                    "• Developed features as an individual contributor to Credit Edge: an application offering a suite of tools for credit monitoring and research applications, serving the needs of nearly 100 investors managing assets over $200B",
                    "• Automated bundling of assets undergoing corporate actions (mergers, acquisitions, credit swaps) into a single transaction, reducing costly errors and creating time savings of several days per quarter with annual savings of tens of thousands of dollars of company time",
                    "• Increased interdepartmental visibility by creating an automated email notification of daily activity",
                    "• Successfully onboarded a new division of investors to the application by preserving interoperability with existing business workflows through data download and export functionality, as well as developing custom tailored solutions catering to their specific needs",
                    "• Increased product robustness and reliability by increasing unit and integration test coverage by 20%",
                    "• Set up application health and error logging using Grafana, Kibana, and Prometheus with real-time notifications to Slack and e-mail."
                ]
            },
            {
                "company": "Flashpoint Learning",
                "title": "Software Engineer",
                "years": "January 2019 - December 2019",
                "description": [
                    "• Spearheaded the front-end development of an educational application for creating flashcard decks, specifically tailored for instructors teaching students with disabilities",
                    "• Architected the Front-End user interface in React and developed necessary functional requirements for the Back-End Spring API, working in tandem with Back-End Engineers to complete features ahead of schedule",
                    "• Developed automated unit and integration testing with Jest and JUnit in support of our CI/CD pipeline, increasing code coverage to 90%",
                    "• Collaborated with product manager to prioritize feature backlog, delegate requirements, and assign tasks"
                ]
            },
            {
                "company": "Digital Systems Project Management",
                "title": "Web Developer",
                "years": "June 2018 - August 2018",
                "description": [
                    "• Oversaw the design, prototyping, documentation, and delivery of a Canvas LMS plugin that automatically tracks student attendance via network proximity with an administrative dashboard integrated directly within the canvas platform"
                ]
            },
            {
                "company": "Hi Delivery",
                "title": "Frontend Developer",
                "years": "April 2015 - August 2018",
                "description": [
                    "• Bootstrapped a feature-rich application for local business owners to manage sales, inventory, delivery, operations, customer management, and delivery logistics.",
                    "• Created storefront components to display products and for customers to interact, manage and place orders",
                    "• Produced admin and application monitoring dashboards",
                    "• Accelerated developer workflow by contributing dozens of reusable elements to a responsive UI component library"
                ]
            }
        ],
        "projects" : [
            {
                "company": "Supply Chain Management Service",
                "title": "Recommendation Engine",
                "years": "September 2024 - Present",
                "description": [
                    "● Developing a service for supply chain management",
                    "● Used to track orders, production, and operational logistics",
                    "● A recommendation engine identifies bottlenecks and possible solutions"
                ]
            },
            {
                "company": "Interactive Visualization of the Indigent Population",
                "title": "Statistical Analysis",
                "years": "December 2019",
                "description": [
                    "● An interactive data exploration of the Department of Housing and Urban Development`s annual Point-In-Time Homelessness count.",
                    "● Implemented a series of interactive widgets with D3.js",
                    "● Data wrangling objectives were expedited by leveraging Python scripts and Pandas for batch CSV file conversion."
                ]
            },
            {
                "company": "Image Classification Model",
                "title": "Machine Learning",
                "years": "November 2019",
                "description": [
                    "● Trained a Convolutional Neural Network for supervised learning of common objects using the CIFAR-10 dataset, with an averaged F1 score of 0.73.",
                    "● Developed an alternative solution with transfer learning using the VGG16 model, providing a training speedup of 4X."
                ]
            },
            {
                "company": "Network Anomaly Detector",
                "title": "Machine Learning",
                "years": "October 2019",
                "description": [
                    "● Used the KDD 1999 Cup dataset to train a predictive model that detects fraudulent network connections.",
                    "● Achieved a 99.85% accuracy rating with a convolutional neural network built with TensorFlow and Pandas."
                ]
            }
        ],
        "skills": [{
            "name": "Data Structures",
            "level": "75%"
        }, {
            "name": "Algorithms",
            "level": "85%"
        }, {
            "name": "System Architecture",
            "level": "75%"
        }, {
            "name": "UI/UX",
            "level": "90%"
        }]
    },
    "badges": {
        "badges": [
            {
                "title": "Java",
                "image": "java.svg"
            },
            {
                "title": "Rust",
                "image": "rust.svg"
            },
            {
                "title": "Golang",
                "image": "golang.svg"
            },
            {
                "title": "Clojure",
                "image": "clojure.svg"
            },
            {
                "title": "Python",
                "image": "python.svg"
            },
            {
                "title": "Babashka",
                "image": "babashka.svg"
            },
            {
                "title": "JavaScript",
                "image": "logo-javascript.svg"
            }, 
            {
                "title": "TypeScript",
                "image": "ts.svg"
            },
            {
                "title": "HTML",
                "image": "HTML5.svg"
            },
            {
                "title": "CSS",
                "image": "CSS3.svg"
            },
            {
                "title": "React",
                "image": "react.svg"
            },
            {
                "title": "NodeJS",
                "image": "node.svg"
            },
            {
                "title": "Spring",
                "image": "spring.svg"
            },
            {
                "title": "GraphQL",
                "image": "graphql.svg"
            },
            {
                "title": "PostgreSql",
                "image": "postgres.svg"
            },
            {
                "title": "git",
                "image": "git.svg"
            },
            {
                "title": "Jira",
                "image": "jira.svg"
            },
            {
                "title": "aws",
                "image": "aws.svg"
            },
            {
                "title": "Docker",
                "image": "docker.svg"
            },
            {
                "title": "Kubernetes",
                "image": "kubernetes.svg"
            },
            {
                "title": "D3.js",
                "image": "d3.svg"
            }

        ]
    },
    "portfolio": {
        "projects": [
            {
            "title": "LearnJS",
            "category": "A Serverless Quiz Application",
            "image": "learnjs.jpg",
            "url": "http://learnjs.derrekg.com.s3-website-us-west-2.amazonaws.com/"
            }, {
                "title": "Indigent Population Statistics - An Exploration with D3.js",
                "category": "Interactive Exploration of Homelessness by state",
                "image": "d3-homeless.jpg",
                "url": "https://derrek-gass.github.io/homeless-map/"
            }
        ]
    },
    "testimonials": {
        "testimonial": [
            {
                "text": "Derrek is a fast learner who is passionate about a plethora of technologies. He is not afraid of taking on new toolsets in order to better tackle the specific problem he is working on. Being able to choose the right tool for the job while also being willing learn new tech to do it right is a highly desirable quality in a software engineer.",
                "user": "Josh Earlenbaugh"
            },
            {
                "text": "It is quite rare to come across an outstanding and hardworking talent such as Derrek. I have had the pleasure of working with and learning from Derrek for over three years, collaborating on several large team projects. Derrek's ability to find inventive solutions and his immense drive to tackle problems served as both inspiring motivation for the team and as an integral part to increasing the team's productivity. Derrek would be a valuable asset for any team.",
                "user": "Alexander Lee"
            },
            {
                "text": "Derrek is a passionate programmer with expertise in RESTful web services, cloud application deployment, and is always excited to learn new frameworks and technologies.",
                "user": "Daniel Scrivano"
            },
            {
                "text": "Derrek and I attended CSUS together for 2 years and worked on a variety of projects together. Consistently, Derrek impressed me with not only the breadth of knowledge that he possessed, but also his ability to expound upon a variety of technologies and frameworks. Be it backend technologies, front end web frameworks, or dev-ops pipelines, Derrek always seemed to have something extremely valuable to contribute to the conversation. Derrek has very strong technical capabilities, but one of his greatest strengths is his easy-to-get-along-with nature and sociability. Any team that chooses to take Derrek on will be bolstered by his eager attitude towards learning new things and his bright personality.",
                "user": "Dimitrios Papageorgacopoulos"
            },
            {
                "text": "Derrek and I had 3 classes together (Data Visualization, Intelligent Systems, and Computing Theory & Programming Languages) which involved group projects. In these group projects, Derrek was always the one doing the heavy lifting on the project. He took initiative, and set up the environment, where all we’d have to do is a “git pull.” He would set the roadmap and expectations of the projects, and break it down to digestible chunks for us to contribute features to. Derrek is not only technically skilled, he is also able to articulate the design of our projects in our class presentations, and in each project we’ve done together, we had received A’s. Derrek is also pleasant to work with, and even though we were the same year in school, he was ahead of me technically, and I see him as a mentor. If you want a more in-depth opinion on Derrek, contact me on LinkedIn.",
                "user": "Jimmy Le"
            },
            {
                "text": "Derrek is highly intelligent with a great eye for detail and understanding of not just the part of a project he is working on, but how that part fits together and integrates with the project as a whole. He is very knowledgeable when it comes to systems design, and optimization and understands how to work well as a part of a team.",
                "user": "Alex Gonzalez"
            }
        ]
    }
}