{
    "main": {
        "name": "Derrek Gass",
        "occupation": "Full Stack Engineer",
        "description": "I am the \"Gass\" that converts fluid ideas into solid ones \n I will transform your idea from a dream into reality",
        "image": "profilepic.jpg",
        "bio": [
            {
                "key": "headline",
                "text" : "Software Engineer | Developing Innovative Solutions"
            },
            {
                "key": "mainSkills",
                "text": "• 💻 Main Skills: Java, JavaScript, TypeScript, React"
            },
            {
                "key": "other",
                "text": "• ⚡ Other Skills: C/C++, Python, Docker, K8s, AWS"
            },
            {
                "key": "curentStudies",
                "text": "• 🌱 Currently Studying for: AWS Certification, Interviews"
            },
            {
                "key": "learning",
                "text": "• 📖 Learning: Rust, Clojure, BETH stack"
            }
        ],
        "contactmessage": "Feel free to get in touch with me. I'd love to discuss an opportunity to work together.",
        "email": "dwgass@gmail.com",
        "phone": "916-690-7701",
        "address": {
            "city": "Santa Cruz",
            "state": "CA"
        },
        "company": "Lambda Phase Systems LLC",
        "website": "lambdaphase.com/",
        "resumedownload": "https://docs.google.com/document/d/14I86YeAxGqGXH_r0pz4OuIephREJQzrL89oIQdvPsu8/export?format=pdf",
        "social": [
            {
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/derrekgass/",
                "className": "fa fa-linkedin"
            },
            {
                "name": "github",
                "url": "https://github.com/derrek-gass",
                "className": "fa fa-github"
            },
            {
                "name": "E-Mail",
                "url": "mailto:dwgass@gmail.com",
                "className": "fa fa-envelope"
            }
        ]
    },
    "resume": {
        "skillmessage": "",
        "education": [
            {
                "school": "California State University - Sacramento",
                "degree": "B.S. Computer Science & Engineering",
                "graduated": "2020",
                "description": ["Dean's List - 3x Recipient", "Software Engineering, Principles of Programming Languages, Data Structures, Computer Architecture, Theory of Computation and Formal Languages, Operating Systems, Distributed Systems, Computer Modeling, Computer Networks, Compiler Construction, and Artificial Intelligence."]
            },
            {
                "school": "Sacramento City College",
                "degree": "A.A. Social Sciences",
                "graduated": "2017",
                "description": ""
            }
        ],
        "work": [
            {
                "company": "Northwestern Mutual",
                "title": "Full Stack Engineer",
                "years": "March 2021 - February 2023",
                "description": [
                    "• Designed and executed improvements for an internal web application responsible for receiving financial data streams from BlackRock and Bloomberg. The application conducts quantitative analytics and delivers valuable data insights to investors across diverse sectors. This effort fosters enhanced collaboration, dependability and consensus for a long-standing financial institution undergoing modernization.",
                    "• Crafted a range of innovative features and enhancements tailored to amplify collaboration, transparency, and operational efficiency for investors. These additions encompass daily email summary notifications, analytical dashboards, data export functionality, user-friendly note functionality, interactive activity feeds, and streamlined automation of multifaceted business tasks. As a result, substantial time savings and an elevated level of reliability were achieved.",
                    "• Addressed significant technical debt through migrating the high-yield investment group away from an obsolete and unreliable .Net and PowerBi application and seamlessly integrating the group within our collaborative ecosystem. The result was a marked enhancement in the accuracy and resilience of financial data, along with a strengthened culture of cooperation."
                ]
            },
            {
                "company": "Flashpoint Learning",
                "title": "Engineering Lead",
                "years": "January 2019 - December 2019",
                "description": [
                    "• Spearheaded the front-end development and full-stack integration of an application encompassing flashcard sets, tutorials, and an instructor dashboard. This initiative aimed to aid educators catering to students facing accessibility challenges. I undertook a comprehensive role across the tech stack, crafting this project as a Progressive Web App (PWA) using React and SpringBoot technologies.",
                    "• Developed automated unit and integration testing with Jest and JUnit in support of our CI/CD pipeline, increasing code coverage by 50%.. ",
                    "• Drafted our project charter, maintained our product backlog and repository, delegated requirements to team members through scheduling and assignment of tasks, and arranged weekly code reviews and merging of pull requests across multiple teams.",
                    "• In my capacity as project manager, I orchestrated client meetings aimed at comprehending business objectives. I dynamically reevaluated the prioritization of functional requisites as we moved closer to finalizing the deliverables and fulfilling the terms of the work contract."
                ]
            },
            {
                "company": "Digital Systems Project Management",
                "title": "Student Project - Team Lead",
                "years": "June 2018 - August 2018",
                "description": [
                    "Oversaw the design, prototyping, documentation, and delivery of a cross-platform application that automatically tracks student attendance (including spoof-detection), with an administrative dashboard provided as a native plugin to the canvas platform."
                ]
            }
        ],
        "skills": [{
            "name": "Data Structures",
            "level": "75%"
        }, {
            "name": "Algorithms",
            "level": "85%"
        }, {
            "name": "System Architecture",
            "level": "75%"
        }, {
            "name": "UI/UX",
            "level": "90%"
        }]
    },
    "badges": {
        "badges": [
            {
                "title": "java",
                "image": "java.svg"
            }, 
            {
                "title": "cpp",
                "image": "c++.svg"
            }, 
            {
                "title": "js",
                "image": "logo-javascript.svg"
            }, 
            {
                "title": "ts",
                "image": "ts.svg"
            },
            {
                "title": "HTML",
                "image": "html5.svg"
            },
            {
                "title": "css",
                "image": "css3.svg"
            },
            {
                "title": "react",
                "image": "react.svg"
            },
            {
                "title": "nodejs",
                "image": "node.svg"
            }

        ]
    },
    "portfolio": {
        "projects": [
            {
            "title": "LearnJS",
            "category": "A Serverless Quiz Application",
            "image": "learnjs.jpg",
            "url": "http://learnjs.derrekg.com.s3-website-us-west-2.amazonaws.com/"
            }, {
                "title": "Indigent Population Statistics - An Exploration with D3.js",
                "category": "Interactive Exploration of Homelessness by state",
                "image": "d3-homeless.jpg",
                "url": "https://derrek-gass.github.io/homeless-map/"
            }
        ]
    },
    "testimonials": {
        "testimonials": [
            {
                "text": "Derrek is a fast learner who is passionate about a plethora of technologies. He is not afraid of taking on new toolsets in order to better tackle the specific problem he is working on. Being able to choose the right tool for the job while also being willing learn new tech to do it right is a highly desirable quality in a software engineer.",
                "user": "Josh Earlenbaugh"
            },
            {
                "text": "It is quite rare to come across an outstanding and hardworking talent such as Derrek. I have had the pleasure of working with and learning from Derrek for over three years, collaborating on several large team projects. Derrek's ability to find inventive solutions and his immense drive to tackle problems served as both inspiring motivation for the team and as an integral part to increasing the team's productivity. Derrek would be a valuable asset for any team.",
                "user": "Alexander Lee"
            },
            {
                "text": "Derrek is a passionate programmer with expertise in RESTful web services, cloud application deployment, and is always excited to learn new frameworks and technologies.",
                "user": "Daniel Scrivano"
            },
            {
                "text": "Derrek and I attended CSUS together for 2 years and worked on a variety of projects together. Consistently, Derrek impressed me with not only the breadth of knowledge that he possessed, but also his ability to expound upon a variety of technologies and frameworks. Be it backend technologies, front end web frameworks, or dev-ops pipelines, Derrek always seemed to have something extremely valuable to contribute to the conversation. Derrek has very strong technical capabilities, but one of his greatest strengths is his easy-to-get-along-with nature and sociability. Any team that chooses to take Derrek on will be bolstered by his eager attitude towards learning new things and his bright personality.",
                "user": "Dimitrios Papageorgacopoulos"
            },
            {
                "text": "Derrek and I had 3 classes together (Data Visualization, Intelligent Systems, and Computing Theory & Programming Languages) which involved group projects. In these group projects, Derrek was always the one doing the heavy lifting on the project. He took initiative, and set up the environment, where all we’d have to do is a “git pull.” He would set the roadmap and expectations of the projects, and break it down to digestible chunks for us to contribute features to. Derrek is not only technically skilled, he is also able to articulate the design of our projects in our class presentations, and in each project we’ve done together, we had received A’s. Derrek is also pleasant to work with, and even though we were the same year in school, he was ahead of me technically, and I see him as a mentor. If you want a more in-depth opinion on Derrek, contact me on LinkedIn.",
                "user": "Jimmy Le"
            },
            {
                "text": "Derrek is highly intelligent with a great eye for detail and understanding of not just the part of a project he is working on, but how that part fits together and integrates with the project as a whole. He is very knowledgeable when it comes to systems design, and optimization and understands how to work well as a part of a team.",
                "user": "Alex Gonzalez"
            }
        ]
    }
}